Autodesk.Revit.DB.ExportLayerKey.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExportLayerKey.SpecialType
The special type for layer key.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.ExportLayerKey.SubCategoryName
The subcategrory Name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLayerKey.CategoryName
The category name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLayerKey.#ctor(System.String,System.String,Autodesk.Revit.DB.SpecialType)
Constructs a new ExportLayerKey with categoryName, subCategoryName and a special type.
categoryName:
The category name for the layer key.
subCategoryName:
The subCategoryName for the layer key.
num:
The special type for layer key.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.ExportLayerKey.#ctor
Constructs a new ExportLayerKey with default values.
Since:
2014

Autodesk.Revit.DB.ExportLayerKey
A key used to represent an item stored in an Autodesk.Revit.DB.ExportLayerTable.
Since:
2014